#include <stdio.h>

int main() {
    int sum, p, x, y;

    sum = 0;                                                    // กำหนดค่าเริ่มต้นของผลรวมเป็น 0

    
    for (x = 1, y = 1; x * y <= 15; x++, y += 2) {              // วนลูปโดยเริ่มจาก x = 1 และ y = 1 จนกว่า x*y จะมากกว่า 15
        p = x * y;                                              // คูณ x กับ y แล้วเก็บไว้ในตัวแปร p
        sum = sum + p;                                          // บวกค่า p เข้าไปในผลรวม sum

       
        printf("%d * %d = %d\n", x, y, p);                     // แสดงผลการคูณในรูปแบบ "x * y = p"        
    }

    
    printf("summation of x * y = %d\n", sum);                  // แสดงค่าผลรวมของทุกการคูณ ของ sum แต่ละกรณี

    return 0;  // จบโปรแกรม
}
/* จาก code ที่ได้เป็นการหาค่าผลรวมหรือ summation ของ x*y โดย ตอนเริ่มต้นมีค่าต่าง ๆ คือ x=1 y=1 sum=0
รอบที่ 1 : x=1 y=1 p=1*1=1 sum=0+1=1(โดย sum คือการเก็บค่าผลรวมของ p ไปเรื่อยๆ จนจบ loop โดยที่ p คือ ผลคูณของ x และ y) จึงแสดงข้อความ 1 * 1 = 1
รอบที่ 2 : x=2 y=3 p=2*3=6 sum=1+6=7 จึงแสดงข้อความ 2 * 3 = 6
รอบที่ 3 : x=3 y=5 p=3*5=15 sum=7+15=22 จึงแสดงข้อความ 3 * 5 = 15
ในรอบสุดท้าย x*y จะเท่ากับ 4*7=28 ทำให้มีค่ามากกว่า 15 เลยไม่อยู่ในเงื่อนไขของ for เลยออกจาก loop
จากกนั้นจึงแสดงข้อความ summation of x * y = 22 

สรุป โปรแกรมนี้เป็นการหาค่า summation ของ ตัวแปร x กับ y โดยที่แทนค่า p เป็นผลคูณของ x กับ y 
และ sum เป็นผลบวกของ p */